## Using Python to Integrate MongoDB Data into an ETL Process
Modern Data Warehousing and Analytics solutions frequently use languages like Python or Scala to extract data from numerous sources, including relational database management systems, NoSQL database systems, real-time streaming endpoints and Data Lakes. These languages can then be used to perform many types of transformation before then loading the data into a variety of destinations including file systems and data warehouses. This data can then be consumed by data scientists or business analysts.

In this lab you will build upon the **Northwind_DW2** dimensional database from Lab 3; however, you will be integrating new data sourced from an instance of MongoDB. The new data will be concerned with new business processes; inventory and purchasing. You will continue to interact with both the source systems (MongoDB and MySQL), and the destination system (the Northwind_DW2 data warehouse) from a remote client running Python (Jupyter Notebooks). 

Just as in Lab 3, you will fetch data into Pandas DataFrames, perform all the necessary transformations in-memory on the client, and then push the newly transformed DataFrame to the RDBMS data warehouse using a Pandas function that will create the table and fill it with data with a single operation.

### Prerequisites:
#### Import the Necessary Libraries

In [1]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

#### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases with which You'll be Working

In [2]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"

atlas_cluster_name = "sandbox.zibbf"
atlas_user_name = "m001-student"
atlas_password = "m001-mongodb-basics"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "northwind_purchasing"
dst_dbname = "northwind_dw2"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://m001-student:m001-mongodb-basics@sandbox.zibbf.mongodb.net

#### Define Functions for Getting Data From and Setting Data Into Databases

In [3]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Populate MongoDB with Source Data
You only need to run this cell once; however, the operation is *idempotent*.  In other words, it can be run multiple times without changing the end result.

In [4]:
client = pymongo.MongoClient(conn_str['local'])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"suppliers" : 'northwind_suppliers.json',
              "invoices" : 'northwind_invoices.json',
              "purchase_orders" : 'northwind_purchase_orders.json',
              "inventory_transactions" : 'northwind_inventory_transactions.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

### 1.0. Create and Populate the New Dimension Tables
#### 1.1. Extract Data from the Source MongoDB Collections Into DataFrames

In [5]:
query = {}
collection = "suppliers"

df_suppliers = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_suppliers.head(2)

   id     company last_name    first_name      job_title
0   1  Supplier A  Andersen  Elizabeth A.  Sales Manager
1   2  Supplier B    Weiler      Cornelia  Sales Manager

In [6]:
# TODO: Extract data from the "Invoices" collection
collection = "invoices"
df_invoices = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_invoices.head(2)

   id  order_id         invoice_date due_date  tax  shipping  amount_due
0   5        31  2006-03-22 16:08:59     None  0.0       0.0         0.0
1   6        32  2006-03-22 16:10:27     None  0.0       0.0         0.0

#### 1.2. Perform Any Necessary Transformations to the DataFrames

In [7]:
df_suppliers.rename(columns={"id":"supplier_key"}, inplace=True)
df_suppliers.head(2)

   supplier_key     company last_name    first_name      job_title
0             1  Supplier A  Andersen  Elizabeth A.  Sales Manager
1             2  Supplier B    Weiler      Cornelia  Sales Manager

In [8]:
# TODO: Perform any required transformations to the "Invoices" dataframe
df_invoices.rename(columns={"id":"invoice_key"}, inplace=True)
df_invoices.head(2)

,invoice_key,order_id,invoice_date,due_date,tax,shipping,amount_due
0,5,31,2006-03-22 16:08:59,None,0.0,0.0,0.0
1,6,32,2006-03-22 16:10:27,None,0.0,0.0,0.0

#### 1.3. Load the Transformed DataFrames into the New Data Warehouse by Creating New Tables

Here we will call our **set_dataframe( )** function to create each dimension table. This function expects a number of parameters including the usual connection information (e.g., user_id, password, MySQL server name and database), the *table_name* we need to assign to the table, the *pandas DataFrame* we crafted to define & populate the table, the *name* we need to assign to the *primary_key* column, and finally, the database operation (insert or update).

In [9]:
dataframe = df_suppliers
table_name = 'dim_suppliers'
primary_key = 'supplier_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [10]:
# TODO: Upload the "Invoices" dataframe to create the new "dim_invoices" dimension table
dataframe = df_invoices
table_name = 'dim_invoices'
primary_key = 'invoice_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### 1.4. Validate that the New Dimension Tables were Created.

In [11]:
sql_suppliers = "SELECT * FROM northwind_dw2.dim_suppliers;"
df_dim_suppliers = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_suppliers)
df_dim_suppliers.head(2)

   supplier_key     company last_name    first_name      job_title
0             1  Supplier A  Andersen  Elizabeth A.  Sales Manager
1             2  Supplier B    Weiler      Cornelia  Sales Manager

In [12]:
# TODO: Validate the new "dim_invoices" table in the northwind_dw2 data warehouse.
sql_invoices = "SELECT * FROM northwind_dw2.dim_invoices;"
df_dim_invoices = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_invoices)
df_dim_invoices.head(2)

,invoice_key,order_id,invoice_date,due_date,tax,shipping,amount_due
0,5,31,2006-03-22 16:08:59,None,0.0,0.0,0.0
1,6,32,2006-03-22 16:10:27,None,0.0,0.0,0.0

### 2.0. Create and Populate the New Fact Tables
#### 2.1. Extract Data from the Source MongoDB Collections Into DataFrames

In [13]:
query = {} # Select all elements (columns), and all documents (rows).

collection = "purchase_orders"

df_pos = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_pos.head(2)

,purchase_order_id,supplier_id,created_by,submitted_date,creation_date,status,expected_date,shipping_fee,taxes,payment_date,...,approved_by,approved_date,submitted_by,purchase_order_detail_id,product_id,quantity,unit_cost,date_received,posted_to_inventory,inventory_id
0,90,1,2.0,2006-01-14 00:00:00,2006-01-22 00:00:00,Approved,None,0.0,0.0,None,...,2.0,2006-01-22 00:00:00,2,238,1,40.0,14.0,2006-01-22 00:00:00,1,59.0
1,91,3,2.0,2006-01-14 00:00:00,2006-01-22 00:00:00,Approved,None,0.0,0.0,None,...,2.0,2006-01-22 00:00:00,2,239,3,100.0,8.0,2006-01-22 00:00:00,1,54.0

In [14]:
# TODO: Extract data for your new "Inventory Transactions" Fact Table
query = {} # Select all elements (columns), and all documents (rows).

collection = "inventory_transactions"

df_invt = get_mongo_dataframe(conn_str['local'], src_dbname, collection, query)
df_invt.head(2)

,id,transaction_type,transaction_created_date,transaction_modified_date,product_id,quantity,purchase_order_id,customer_order_id
0,35,Purchased,2006-03-22 16:02:28,2006-03-22 16:02:28,80,75,None,None
1,36,Purchased,2006-03-22 16:02:48,2006-03-22 16:02:48,72,40,None,None

#### 2.2. Perform Any Necessary Transformations to the DataFrames

In [15]:
column_name_map = {"purchase_order_id" : "purchase_order_key",
                   "supplier_id" : "supplier_key",
                   "purchase_order_detail_id" : "purchase_order_detail_key",
                   "product_id" : "product_key",
                   "inventory_id" : "inventory_key"
                  }

df_pos.rename(columns=column_name_map, inplace=True)
df_pos.insert(0, "fact_purchase_order_key", range(1, df_pos.shape[0]+1))
df_pos.head(2)

,fact_purchase_order_key,purchase_order_key,supplier_key,created_by,submitted_date,creation_date,status,expected_date,shipping_fee,taxes,...,approved_by,approved_date,submitted_by,purchase_order_detail_key,product_key,quantity,unit_cost,date_received,posted_to_inventory,inventory_key
0,1,90,1,2.0,2006-01-14 00:00:00,2006-01-22 00:00:00,Approved,None,0.0,0.0,...,2.0,2006-01-22 00:00:00,2,238,1,40.0,14.0,2006-01-22 00:00:00,1,59.0
1,2,91,3,2.0,2006-01-14 00:00:00,2006-01-22 00:00:00,Approved,None,0.0,0.0,...,2.0,2006-01-22 00:00:00,2,239,3,100.0,8.0,2006-01-22 00:00:00,1,54.0

In [16]:
# TODO: Perform any required transformations to the inventory transactions dataframe
column_name_map2 = {"inventory_trans_id" : "inventory_trans_key",
                   "product_id" : "product_key",
                   "purchase_order_id" : "purchase_order_key",
                   "customer_order_id" : "customer_order_key",
                  }

df_invt.rename(columns=column_name_map2, inplace=True)
df_invt.insert(0, "fact_inventory_trans_key", range(1, df_invt.shape[0]+1))
df_invt.head(2)

,fact_inventory_trans_key,id,transaction_type,transaction_created_date,transaction_modified_date,product_key,quantity,purchase_order_key,customer_order_key
0,1,35,Purchased,2006-03-22 16:02:28,2006-03-22 16:02:28,80,75,None,None
1,2,36,Purchased,2006-03-22 16:02:48,2006-03-22 16:02:48,72,40,None,None

#### 2.3. Load Newly Transformed MongoDB Data into the Northwind_DW2 Data Warehouse

In [17]:
dataframe = df_pos
table_name = 'fact_purchase_orders'
primary_key = 'Fact_purchase_order_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [18]:
# TODO: Upload the "Inventory Transaction" dataframe to create the new "fact_inventory_transactions" fact table.
dataframe = df_invt
table_name = 'fact_inventory_trans'
primary_key = 'Fact_inventory_trans_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### 2.4. Validate that the New Fact Tables were Created

In [19]:
sql_purchase_orders = "SELECT * FROM northwind_dw2.fact_purchase_orders;"
df_fact_purchase_orders = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_purchase_orders)
df_fact_purchase_orders.head(2)

,fact_purchase_order_key,purchase_order_key,supplier_key,created_by,submitted_date,creation_date,status,expected_date,shipping_fee,taxes,...,approved_by,approved_date,submitted_by,purchase_order_detail_key,product_key,quantity,unit_cost,date_received,posted_to_inventory,inventory_key
0,1,90,1,2.0,2006-01-14 00:00:00,2006-01-22 00:00:00,Approved,None,0.0,0.0,...,2.0,2006-01-22 00:00:00,2,238,1,40.0,14.0,2006-01-22 00:00:00,1,59.0
1,2,91,3,2.0,2006-01-14 00:00:00,2006-01-22 00:00:00,Approved,None,0.0,0.0,...,2.0,2006-01-22 00:00:00,2,239,3,100.0,8.0,2006-01-22 00:00:00,1,54.0

In [20]:
# TODO: Validate the correctness of the new "Inventory Transactions" fact table.
sql_inventory_trans = "SELECT * FROM northwind_dw2.fact_inventory_trans;"
df_fact_inventory_trans = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_inventory_trans)
df_fact_inventory_trans.head(2)

,fact_inventory_trans_key,id,transaction_type,transaction_created_date,transaction_modified_date,product_key,quantity,purchase_order_key,customer_order_key
0,1,35,Purchased,2006-03-22 16:02:28,2006-03-22 16:02:28,80,75,None,None
1,2,36,Purchased,2006-03-22 16:02:48,2006-03-22 16:02:48,72,40,None,None